Autodesk.Revit.DB.WallSweepInfo.IsEqual(Autodesk.Revit.DB.WallSweepInfo)
Determines if the input object is equivalent to this WallSweepInfo.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.WallSweepInfo.WallSweepOrientation
Indicates how the profile of a horiztonal sweep is oriented with repect to the wall side face.
Allowed values are Horizontal and Perpendicular. Default is Perpendicular
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.WallSweepInfo.DistanceMeasuredFrom
Indicates if Distance is measured from the top or bottom of the wall.
If the sweep or reveal is vertical, DistanceMeasuredFrom.Base represents the
start of the wall's location curve (t=0). DistanceMeasuredFrom.Top is currently
not implemented for vertical sweeps and shouldn't be used when creating them.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.WallSweepInfo.MaterialId
The element id of the material used to create the sweep or reveal.
Remarks:
This value is not used when creating standalone wall sweeps.  The material id of the
wall sweep's type is used instead.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.WallSweepInfo.ProfileId
The element id of the profile family used to create the sweep or reveal.
Remarks:
This value is not used when creating standalone wall sweeps.  The profile id of the
wall sweep's type is used instead.
May be InvalidElementId if the default profile is used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.WallSweepInfo.WallOffset
The offset from the sweep or reveal to the wall.
If the sweep is a solid sweep, a negative value moves it toward the wall core.
If the sweep is a reveal, a negative offset value moves it away from the wall.
Since:
2012

Autodesk.Revit.DB.WallSweepInfo.Distance
Represents the distance from either the top or base of the wall for horizontal sweeps,
or the parameter along the wall's path curve for vertical ones.
DistanceMeasuredFrom determines where the measurement starts from, depending on the orientation of the sweep.
If the sweep or reveal is vertical, this distance is equal to the parameter along the wall's path curve.
Since:
2012